package nyaitter

// 変換一覧(上から順に置換されていく)
var keyword = map[string]string{
    "コピペ": "にゃにゃにゃにゃおっうにゃおっｗｗｗｗｗｗｗｗパンッパァンッパァンッ(Ctrl+Cの音)にゃっにゃおっにゃにゃにゃおｗｗｗｗにゃっっにゃにゃにゃにゃおっｗｗｗｗｗｗｗｗパァンッパァンッ(Ctrl+Vの音)にゃにゃにゃおっっｗｗｗｗにゃにゃっ",
    "こぴぺ": "にゃにゃにゃにゃおっうにゃおっｗｗｗｗｗｗｗｗパンッパァンッパァンッ(Ctrl+Cの音)にゃっにゃおっにゃにゃにゃおｗｗｗｗにゃっっにゃにゃにゃにゃおっｗｗｗｗｗｗｗｗパァンッパァンッ(Ctrl+Vの音)にゃにゃにゃおっっｗｗｗｗにゃにゃっ",
    "oh":     "ｵｵﾝ",
    "oh...":  "ｵｵｵｵｵｵﾝ",
    "ﾊﾞｷｭｰﾝ": "ﾆｬｵｰﾝ",
    "わおーん":   "ﾆｬｵｰﾝ",
    "うま言う":   "ちょw誰が上手いこと言えって言ったにゃww",
    "まだ":     "まだにゃ",
    "した":     "したにゃ",
    "った":     "ったにゃ",
    "です":     "ですにゃ",
    "よう":     "ようにゃ",
    "ます":     "ますにゃ",
    "しい":     "しいにゃ",
    "IT藤原猫":  "は゛ぁ゛あ゛ぁ゛ぁ゛ぁ゛猫゛か゛わ゛い゛い゛に゛ゃ゛ぁ゛\n#IT藤原猫\n",
    "IT藤原犬":  "は゛ぁ゛あ゛ぁ゛ぁ゛ぁ゛犬゛か゛わ゛い゛い゛に゛ゃ゛ぁ゛\n#IT藤原犬\n",
    "びっとねこ":"⊱ฅ•ω•ฅ⊰",
    "ねこ":      "にゃーん (=･ω･=)",
    "な":      "にゃ",
}
